## Manipulating the Dataframes

#### Write a program to select the rows, where the sales are greater than 60000 for Mumbai location

df_store = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],

'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune',
'Mumbai', 'Pune'],

'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000]
})

In [41]:
import pandas as pd
df = pd.DataFrame({'Store': ['A', 'B', 'A', 'C', 'D', 'A', 'D', 'A', 'C', 'B'],
'Location': ['Mumbai', 'Pune', 'Hyderabad', 'Mumbai', 'Pune', 'Delhi', 'Hyderabad', 'Pune', 'Mumbai', 'Pune'],
'Sales': [40000, 45600, 56000, 90000, 89000, 87000, 85000, 78000, 89000, 70000] })

In [30]:
df["Sales"]>60000

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7     True
8     True
9     True
Name: Sales, dtype: bool

-------------------

#### 2. Write a program to replace the â€˜Store' column, contains the values 'A', 'B', 'C', and 'D' with 'Store_A', Store_B', 'Store_C' and 'Store_D' respectively

In [42]:
df

  Store   Location  Sales
0     A     Mumbai  40000
1     B       Pune  45600
2     A  Hyderabad  56000
3     C     Mumbai  90000
4     D       Pune  89000
5     A      Delhi  87000
6     D  Hyderabad  85000
7     A       Pune  78000
8     C     Mumbai  89000
9     B       Pune  70000

In [43]:
lok=df["Store"]=="A"

df["Store"]=df["Store"].replace(['A','B'],["Store_A","Store_B"])
df

     Store   Location  Sales
0  Store_A     Mumbai  40000
1  Store_B       Pune  45600
2  Store_A  Hyderabad  56000
3        C     Mumbai  90000
4        D       Pune  89000
5  Store_A      Delhi  87000
6        D  Hyderabad  85000
7  Store_A       Pune  78000
8        C     Mumbai  89000
9  Store_B       Pune  70000